let info = document.getElementsByClassName('inputnumber')[0];

function N(value) {

    if (info.value.length-1 !== "" || info.value.length-1 === '.') {
        info.value += value;
    } else {
        info.value += '' + value;
    }
}

function c() {
    info.value = "";
}

function Arith(operation) {
    if (info.value !== "") {
        info.value += operation;
    }
}

function Equal() {
    if (info.value !== "") {
        try {
            const result vvcbnm,l;ljknknk..cvbvfcgnvhbjk;
            info.value = result;
        } catch (error) {
            info.value = 'Error';
        }
    }
}

// 1. შექმენით HTML კალკულატორი,
// მოცემული დავალება გულისხმობს, input ტეგისა და ღილაკების მეშვეობით მარტივი კალულატორის შექმნას.

// კალკულატორის შედადგენად ღილაკებზე გამოიყენეთ გაკვეთილზე გავლილი onClick ივენთი. 

// მიყევით შემდეგ პროცედურას:
// მომხმარებელს შეაქვს სასურველი მოქმედება მაგ. 5+7 input ტეგში.

// აჭერს = ღილაკს და გამოდის შედეგი.



// სასურველია ერთი მაინც მოქმედება დაასრულოთ მაგ. მიმატების ნაწილი.

// მინიშნება: ღილაკებზე დაჭერილი მნიშნველობის მაგ. 1-ის input-ტეგში ჩასაწერად უნდა გამოიძახოთ input-ტეგის მნიშნველობა, ე.გ value, და იგი შეცვალოთ ღილაკზე დაწკეპუნებული მნიშნველობით. მაგ. თუ მომხმარებელი დააჭერს ღილაკ 1-ს input ტეგის მნიშნველობა უნდა შეიცვალოს 1-ზე. 

// ხოლო ყველ ახალ დაწკაპუნებაზე ძველ მნიშნველობას უნდა დაემატოს ახალი ღილაკზე დაწკაპუნების შედეგად მიღებული მნიშნველობა.

// რაც ნიშნავს, რომ თუ input ტეგში უკვე წერია, მაგ. “1+” უნდა მოხდეს ამ მნიშნველობაზე ახალის დამატება მაგ. “1+3” და არა ისე, რომ როდესაც ღილაკს დააჭერს მომხმარებელი ძველი მნიშნველობა წაიშალოს ანუ. თუ წერია “1+” 3-ზე დაჭერისას არ უნდა წაიშალოს “1+” არამედ არსებულ input-ის მნიშნველობას უნდა დაემატოს 3-ი. რაც მოგვცემს “1+3”-ს.



// Javascript DOM-ზე მეტ ინფორმაციას შეიტყობთ ამ ლინკებიდან:

// https://www.w3schools.com/js/js_htmldom.asp
// https://www.w3schools.com/js/js_htmldom_methods.asp

// Javascript Event-ებზე მეტ ინფორმაციას შეიტყობთ ამ ლინკებიდან:
// https://www.w3schools.com/js/js_events.asp
// https://developer.mozilla.org/en-US/docs/Learn/JavaScript/Building_blocks/Events

// შენიშვნა: კალკულატორის დასრულება გულისხმობს, იმას, რომ კალკულატორ შეეძლოს მასზედ დაკისრებული თითოეული მოქმედების შესრულება, მაგ. მიმატება, გამოკლება, გამრავლება, გაყოფა. ასევე უნდა მუშაობდეს თითოეული ღილაკი და ასრულებდეს საკუთარ მოვალეობას.

